app/views/bids/index.html.erb

SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."id" = ? LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
          <td><%= image_tag("logo.png", :height => '100px', :width => '100px')%></td>
          <td><%= User.find(Prototype.find(bid.prototypeid).user_id).company%></td>