app/views/prototypes/index.html.erb


    <% current_user.prototypes.each do |prototype| %>
---
SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."user_id" = 1