app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids"
---
 def index
    @bids = Bid.all

INSERT INTO "bids" ("cost", "created_at", "prototypeid", "status", "time", "updated_at", "vendorid") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create

    flash.now[:notice] = "NOTICE FLASH"
    @bid = Bid.create(params[:bid])