app/controllers/prototypes_controller.rb

SELECT "prototypes".* FROM "prototypes"
---
  def index
    @prototypes = Prototype.all

SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @prototype = Prototype.find(params[:id])

SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @prototype = Prototype.find(params[:id])

INSERT INTO "prototypes" ("attachment_content_type", "attachment_file_name", "attachment_file_size", "attachment_updated_at", "comment", "created_at", "material", "open", "tolerance", "units", "updated_at", "user_id", "volume") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    flash.now[:notice] = "NOTICE FLASH"
    @user = current_user
    @prototype = @user.prototypes.create(params[:prototype])

SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "prototypes" SET "open" = 't', "material" = 'soft metals', "updated_at" = '2013-05-08 18:47:09.421450' WHERE "prototypes"."id" = 4
---
  def update
    @prototype = Prototype.find(params[:id])

    respond_to do |format|
      if @prototype.update_attributes(params[:prototype])

SELECT "prototypes".* FROM "prototypes" WHERE "prototypes"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "prototypes" WHERE "prototypes"."id" = ?  [["id", 3]]
---
  def destroy
    @prototype = Prototype.find(params[:id])
    @prototype.destroy